my_emacs/config.org
* Lsp-Treemacs
#+BEGIN_SRC emacs-lisp
(use-package lsp-treemacs
  :ensure t
  :commands lsp-treemacs-errors-list)
#+END_SRC
* Dashboard
#+BEGIN_SRC emacs-lisp
(use-package dashboard
  :ensure t
  :config
  (dashboard-setup-startup-hook)
  (setq dashboard-items '((recents  . 5)
			  (bookmarks . 5)))
  (setq dashboard-set-heading-icons t)
  (setq dashboard-set-file-icons t)
  (setq dashboard-startup-banner "~/.emacs.d/CondorEmacs.png")
  (setq dashboard-banner-logo-title "Welcome to Condor Emacs!")
  (setq dashboard-set-navigator t)
  (setq dashboard-navigator-buttons
	`(((,(all-the-icons-octicon "mark-github" :height 1.1 :v-adjust 0.0)
	    "Homepage"
	    "Browse homepage"
	    (lambda (&rest _) (browse-url "https://github.com/apemangr/Condor-Emacs/")))

	   (,(all-the-icons-faicon "archive" :height 1.1 :v-adjust 0.0)
	    "Update Packages"
	    "Click to updates your packages"
	    (lambda (&rest _) (auto-package-update-now)))

	   (,(all-the-icons-octicon "gear" :height 1.1 :v-adjust 0.0)
	    "Configuration"
	    "Click to config Condor Emacs"
	    (lambda (&rest _) (find-file "~/.emacs.d/config.org")))))))
#+END_SRC
* Better scrolling
#+BEGIN_SRC emacs-lisp
(setq scroll-step 1)
(setq scroll-margin 1)
(setq scroll-conservatively 101)
(setq scroll-up-aggressively 0.01)
(setq scroll-down-aggressively 0.01)
(setq auto-window-vscroll nil)
(setq fast-but-imprecise-scrolling nil)
(setq mouse-wheel-scroll-amount '(1 ((shift) . 1)))
(setq mouse-wheel-progressive-speed nil)
;; Horizontal Scroll
(setq hscroll-step 1)
(setq hscroll-margin 1)
#+END_SRC
* Org-mode
#+begin_src emacs-lisp
    (setq org-startup-indented t
          org-bullets-bullet-list '(" ") ;; no bullets, needs org-bullets package
          org-ellipsis "  " ;; folding symbol
          org-pretty-entities t
          org-hide-emphasis-markers t
          ;; show actually italicized text instead of /italicized text/
          org-agenda-block-separator ""
          org-fontify-whole-heading-line t
          org-fontify-done-headline t
          org-fontify-quote-and-verse-blocks t)

    ;; (add-hook 'org-mode-hook (lambda ()
    ;;    "Beautify Org Checkbox Symbol"
    ;;    (push '("[ ]" .  "☐") prettify-symbols-alist)
    ;;    (push '("[X]" . "☑" ) prettify-symbols-alist)
    ;;    (push '("[-]" . "❍" ) prettify-symbols-alist)
    ;;    (push '("#+BEGIN_SRC" . "↦" ) prettify-symbols-alist)
    ;;    (push '("#+END_SRC" . "⇤" ) prettify-symbols-alist)
    ;;    (push '("#+BEGIN_EXAMPLE" . "↦" ) prettify-symbols-alist)
    ;;    (push '("#+END_EXAMPLE" . "⇤" ) prettify-symbols-alist)
    ;;    (push '("#+BEGIN_QUOTE" . "↦" ) prettify-symbols-alist)
    ;;    (push '("#+END_QUOTE" . "⇤" ) prettify-symbols-alist)
    ;;    (push '("#+begin_quote" . "↦" ) prettify-symbols-alist)
    ;;    (push '("#+end_quote" . "⇤" ) prettify-symbols-alist)
    ;;    (push '("#+begin_example" . "↦" ) prettify-symbols-alist)
    ;;    (push '("#+end_example" . "⇤" ) prettify-symbols-alist)
    ;;    (push '("#+begin_src" . "↦" ) prettify-symbols-alist)
    ;;    (push '("#+end_src" . "⇤" ) prettify-symbols-alist)
    ;;    (prettify-symbols-mode)))
#+end_src
* Dired, the Directory Editor
#+BEGIN_SRC emacs-lisp
  (use-package dired
    :ensure nil
    :config
    ;; Switches passed to `ls' for Dired.
    (setq dired-listing-switches "-alt")
    :custom (dired-dwim-target t "guess a target directory")
    ;:hook
   ; (dired-mode . dired-hide-details-mode)
  )
  (use-package dired-hacks-utils
    :ensure t
    )
#+END_SRC

This provides a sidebar with a dired buffer for the current directory
#+BEGIN_SRC emacs-lisp
  (use-package dired-toggle
    :defer t)
#+END_SRC

Usually I'm not interested in dotfiles
#+BEGIN_SRC emacs-lisp
  (use-package dired-hide-dotfiles
    :bind
    (:map dired-mode-map
          ("." . dired-hide-dotfiles-mode))
    :hook
    (dired-mode . dired-hide-dotfiles-mode))
#+END_SRC

And I like more colors
#+BEGIN_SRC emacs-lisp
  (use-package diredfl
    :ensure t
    :hook
    (dired-mode . diredfl-mode))
#+END_SRC

From http://pragmaticemacs.com/emacs/tree-style-directory-views-in-dired-with-dired-subtree/

The dired-subtree package (part of the magnificent dired hacks) improves on this by
allowing you to expand subdirectories in place, like a tree structure. To install the
package, use the following code:
#+BEGIN_SRC emacs-lisp
  ;; (use-package dired-subtree
  ;;   :ensure nil
  ;;   :config
  ;;   (bind-keys :map dired-mode-map
  ;;              ("i" . dired-subtree-insert)
  ;;              (";" . dired-subtree-remove)))
#+END_SRC

This sets up the keybinds so that in dired, hitting i on a subdirectory expands it in
place with an indented listing. You can expand sub-subdirectories in the same way, and so
on. Hitting ; inside an expanded subdirectory collapses it.

A nice overview for git repositories in dired
#+begin_src emacs-lisp
(use-package dired-git-info
    :ensure t
    :bind (:map dired-mode-map
                (")" . dired-git-info-mode)))
#+end_src

From [[http://pragmaticemacs.com/emacs/dynamically-filter-directory-listing-with-dired-narrow/][Dynamically filter directory listing with dired-narrow | Pragmatic Emacs]] a useful
addition to narrow dired to match filter

#+begin_src emacs-lisp
(use-package dired-narrow
  :ensure t
  :bind (:map dired-mode-map
              ("/" . dired-narrow)))
#+end_src

* emacs-leuven
** Registers (Navigation)
*** Saving Positions in Registers

*Registers:*

- ~C-x r SPC~ ::
     ~point-to-register~.  Store point in a register.  Type any character to
     specify a register when prompted.

- ~C-x r j~ ::
     ~jump-to-register~.  Jump to a point stored in a register.

Setup registers for files I commonly edit.

#+begin_src emacs-lisp :tangle no
  (set-register ?c '(file . "/home/ivanir/my_config"))
  (set-register ?b '(file . "/home/ivanir/my_config/my_bashrc"))
  (set-register ?o '(file . "/home/ivanir/my_config/my_emacs/config.org"))
  (set-register ?e '(file . "/home/ivanir/my_config/my_emacs"))
#+end_src

** Navigating with Bookmarks

*** Bookmark

If you need to *move to somewhere in your document* and want a *quick way to
return*, you can create a *bookmark WITH MNEMONIC* on the current line.

***Bookmarks:*

- C-x r m ::
     ~C-x r m RET~ or ~C-x r m BOOKMARK RET~ (~M-x bookmark-set~).  Save a named
     bookmark.

- C-x r b ::
     ~bookmark-jump~.  Jump to a named bookmark.

- C-x r l ::
     List all bookmarks.

#+begin_note
Bookmarks are *persistent* across sessions and they have *names*; not /markers/.
Bookmarked positions can also be *relocated* (found) if they move slightly because
of text changes.
#+end_note

#+begin_src emacs-lisp

  (use-package bookmark
    :config
    ;; Where to save the bookmarks.
    (setq bookmark-default-file (concat user-emacs-directory "bookmarks.bmk"))
                                        ;! A `.txt' extension would load Org at
                                        ;! the time `bookmark' is required!

    ;; Each command that sets a bookmark will also save your bookmarks.
    (setq bookmark-save-flag 1)
 )
#+end_src

