my_emacs/config.el

(use-package lsp-treemacs
  :ensure t
  :commands lsp-treemacs-errors-list)

(use-package dashboard
  :ensure t
  :config
  (dashboard-setup-startup-hook)
  (setq dashboard-items '((recents  . 5)
			  (bookmarks . 5)))
  (setq dashboard-set-heading-icons t)
  (setq dashboard-set-file-icons t)
  (setq dashboard-startup-banner "~/.emacs.d/CondorEmacs.png")
  (setq dashboard-banner-logo-title "Welcome to Condor Emacs!")
  (setq dashboard-set-navigator t)
  (setq dashboard-navigator-buttons
	`(((,(all-the-icons-octicon "mark-github" :height 1.1 :v-adjust 0.0)
	    "Homepage"
	    "Browse homepage"
	    (lambda (&rest _) (browse-url "https://github.com/apemangr/Condor-Emacs/")))

	   (,(all-the-icons-faicon "archive" :height 1.1 :v-adjust 0.0)
	    "Update Packages"
	    "Click to updates your packages"
	    (lambda (&rest _) (auto-package-update-now)))

	   (,(all-the-icons-octicon "gear" :height 1.1 :v-adjust 0.0)
	    "Configuration"
	    "Click to config Condor Emacs"
	    (lambda (&rest _) (find-file "~/.emacs.d/config.org")))))))

(setq scroll-step 1)
(setq scroll-margin 1)
(setq scroll-conservatively 101)
(setq scroll-up-aggressively 0.01)
(setq scroll-down-aggressively 0.01)
(setq auto-window-vscroll nil)
(setq fast-but-imprecise-scrolling nil)
(setq mouse-wheel-scroll-amount '(1 ((shift) . 1)))
(setq mouse-wheel-progressive-speed nil)
;; Horizontal Scroll
(setq hscroll-step 1)
(setq hscroll-margin 1)

(setq org-startup-indented t
      org-bullets-bullet-list '(" ") ;; no bullets, needs org-bullets package
      org-ellipsis "  " ;; folding symbol
      org-pretty-entities t
      org-hide-emphasis-markers t
      ;; show actually italicized text instead of /italicized text/
      org-agenda-block-separator ""
      org-fontify-whole-heading-line t
      org-fontify-done-headline t
      org-fontify-quote-and-verse-blocks t)

;; (add-hook 'org-mode-hook (lambda ()
;;    "Beautify Org Checkbox Symbol"
;;    (push '("[ ]" .  "☐") prettify-symbols-alist)
;;    (push '("[X]" . "☑" ) prettify-symbols-alist)
;;    (push '("[-]" . "❍" ) prettify-symbols-alist)
;;    (push '("#+BEGIN_SRC" . "↦" ) prettify-symbols-alist)
;;    (push '("#+END_SRC" . "⇤" ) prettify-symbols-alist)
;;    (push '("#+BEGIN_EXAMPLE" . "↦" ) prettify-symbols-alist)
;;    (push '("#+END_EXAMPLE" . "⇤" ) prettify-symbols-alist)
;;    (push '("#+BEGIN_QUOTE" . "↦" ) prettify-symbols-alist)
;;    (push '("#+END_QUOTE" . "⇤" ) prettify-symbols-alist)
;;    (push '("#+begin_quote" . "↦" ) prettify-symbols-alist)
;;    (push '("#+end_quote" . "⇤" ) prettify-symbols-alist)
;;    (push '("#+begin_example" . "↦" ) prettify-symbols-alist)
;;    (push '("#+end_example" . "⇤" ) prettify-symbols-alist)
;;    (push '("#+begin_src" . "↦" ) prettify-symbols-alist)
;;    (push '("#+end_src" . "⇤" ) prettify-symbols-alist)
;;    (prettify-symbols-mode)))

(use-package dired
  :ensure nil
  :config
  ;; Switches passed to `ls' for Dired.
  (setq dired-listing-switches "-alt")
  :custom (dired-dwim-target t "guess a target directory")
  ;:hook
 ; (dired-mode . dired-hide-details-mode)
)
(use-package dired-hacks-utils
  :ensure t
  )

(use-package dired-toggle
  :defer t)

(use-package dired-hide-dotfiles
  :bind
  (:map dired-mode-map
        ("." . dired-hide-dotfiles-mode))
  :hook
  (dired-mode . dired-hide-dotfiles-mode))

(use-package diredfl
  :ensure t
  :hook
  (dired-mode . diredfl-mode))

;; (use-package dired-subtree
;;   :ensure nil
;;   :config
;;   (bind-keys :map dired-mode-map
;;              ("i" . dired-subtree-insert)
;;              (";" . dired-subtree-remove)))

(use-package dired-git-info
    :ensure t
    :bind (:map dired-mode-map
                (")" . dired-git-info-mode)))

(use-package dired-narrow
  :ensure t
  :bind (:map dired-mode-map
              ("/" . dired-narrow)))

(use-package bookmark
   :config
   ;; Where to save the bookmarks.
   (setq bookmark-default-file (concat user-emacs-directory "bookmarks.bmk"))
                                       ;! A `.txt' extension would load Org at
                                       ;! the time `bookmark' is required!

   ;; Each command that sets a bookmark will also save your bookmarks.
   (setq bookmark-save-flag 1)
)
